# Preprocesamiento de Datos con Python
## Fes Aragón
### ICO
#### JUAN MIGUEL TORRES GÓMEZ

In [4]:
import pandas as pd
import numpy as np

In [6]:
#Series
s = pd.Series({'a': 10, 'b': 20, 'c': 30})
print(type(s))
s

<class 'pandas.core.series.Series'>

a    10
b    20
c    30
dtype: int64

In [9]:
s.index

Index(['a', 'b', 'c'], dtype='object')

In [7]:
s1 = pd.Series([10,20,30,40])
s1

0    10
1    20
2    30
3    40
dtype: int64

In [10]:
s1.index

RangeIndex(start=0, stop=4, step=1)

In [12]:
s1.max()

40

In [13]:
s1.describe()

count     4.000000
mean     25.000000
std      12.909944
min      10.000000
25%      17.500000
50%      25.000000
75%      32.500000
max      40.000000
dtype: float64

In [15]:
#GENERAMOS UNA SERIE DE NUMEROS ALEATORIOS
s2 = pd.Series(np.random.randn(5))
s2

0   -0.423768
1    0.830039
2   -1.222223
3    1.426105
4    0.011993
dtype: float64

In [19]:
s3 = pd.Series([[10, 20],\
                [30, 40.5,'series'],\
                [50, 55],\
                {'Name':'Tess','Org':'Packt'}])
s3

0                            [10, 20]
1                  [30, 40.5, series]
2                            [50, 55]
3    {'Name': 'Tess', 'Org': 'Packt'}
dtype: object

In [27]:
s3.describe()

count            4
unique           4
top       [10, 20]
freq             1
dtype: object

In [28]:
#shape nos dice la forma que tiene nuestro objeto
s3.shape

(4,)

In [31]:
#DataFrame
df = pd.DataFrame([30,50,20])
print(type(df))
print(df.shape)

<class 'pandas.core.frame.DataFrame'>
(3, 1)

In [33]:
df.columns

RangeIndex(start=0, stop=1, step=1)

In [34]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [37]:
list(df.index)

[0, 1, 2]

In [40]:
print("Las columnas del DF son : ", list(df.columns))
print("Los indices de renglones del DF son : ", list(df.index))

Las columnas del DF son :  [0]
Los indices de renglones del DF son :  [0, 1, 2]

In [42]:
df.columns = ["C1"]
df.index = ["R1","R2","R3"]
df

    C1
R1  30
R2  50
R3  20

In [47]:
df["C1"]

R1    30
R2    50
R3    20
Name: C1, dtype: int64

In [56]:
#PODEMOS GUARDAR IGUAL OBJETOS COMO TUPLAS
#L = [[(0, 1, 2)], [(1, 2, 3)], [(4, 5, 6)], [(7, 8, 9)]]
#O GUARDAMOS LOS VALORES DE LOS OBJETOS
L = [(0, 1, 2), (1, 2, 3), (4, 5, 6), (7, 8, 9)]
df1 = pd.DataFrame(data=L)
print(df1.shape)
df1

(4, 3)

   0  1  2
0  0  1  2
1  1  2  3
2  4  5  6
3  7  8  9

In [60]:
L2 = [(0, 1, 2), (1, 2, 3), (4, 5, 6), (7, 8, 9,10)]
df12 = pd.DataFrame(data=L2)
print(df12.shape)
df12

(4, 4)

   0  1  2     3
0  0  1  2   NaN
1  1  2  3   NaN
2  4  5  6   NaN
3  7  8  9  10.0

In [65]:
L3 = [(0, 1, 2), (1, 2, 3), (4, 5, 6), (7, 8, 9)]
df13 = pd.DataFrame(data=L3,
#acepta listas o tuplas, algun objeto iterable
                   columns=("C1","C2","C3"),
                   index = ["R1","R2","R3","R4"])
df13

    C1  C2  C3
R1   0   1   2
R2   1   2   3
R3   4   5   6
R4   7   8   9

In [70]:
df13.describe()

             C1        C2        C3
count  4.000000  4.000000  4.000000
mean   3.000000  4.000000  5.000000
std    3.162278  3.162278  3.162278
min    0.000000  1.000000  2.000000
25%    0.750000  1.750000  2.750000
50%    2.500000  3.500000  4.500000
75%    4.750000  5.750000  6.750000
max    7.000000  8.000000  9.000000

In [72]:
df12.describe()

              0         1         2     3
count  4.000000  4.000000  4.000000   1.0
mean   3.000000  4.000000  5.000000  10.0
std    3.162278  3.162278  3.162278   NaN
min    0.000000  1.000000  2.000000  10.0
25%    0.750000  1.750000  2.750000  10.0
50%    2.500000  3.500000  4.500000  10.0
75%    4.750000  5.750000  6.750000  10.0
max    7.000000  8.000000  9.000000  10.0

In [102]:
d = {'py101':[10, 5, 33 ,45, 25, 22], 
                'py111':[0, 15, 21 , 30, 31, 11], 
                'py121':[15, 5, 1 ,10, 42, 21], 
                'py301':[20, 35, 3 ,15, 0, 0], }
meses = ('enero', 'febrero', 'marzo', 'abril', 'mayo', 'junio')

df4 = pd.DataFrame(data = d, index=meses)
df4

         py101  py111  py121  py301
enero       10      0     15     20
febrero      5     15      5     35
marzo       33     21      1      3
abril       45     30     10     15
mayo        25     31     42      0
junio       22     11     21      0

In [84]:
m = np.arange(9).reshape(3,3)
m

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [86]:
df5 = pd.DataFrame(m, index=['uno', 'dos', 'tres'], columns=['c1', 'c2', 'c3'])
df5

      c1  c2  c3
uno    0   1   2
dos    3   4   5
tres   6   7   8

In [90]:
#ESTAN VACIAS LAS OTRAS COLUMNAS PORQUE EN DATA NO EXISTEN 
#IDENTIFICADORES COMO SILLAS MESAS ETC
df6 = pd.DataFrame(data=d, index=meses, columns=['py101', 'sillas', 'bancos', 'puertas'])
df6

         py101 sillas bancos puertas
enero       10    NaN    NaN     NaN
febrero      5    NaN    NaN     NaN
marzo       33    NaN    NaN     NaN
abril       45    NaN    NaN     NaN
mayo        25    NaN    NaN     NaN
junio       22    NaN    NaN     NaN

In [103]:
df7 = pd.DataFrame(d, index=meses)
df7

         py101  py111  py121  py301
enero       10      0     15     20
febrero      5     15      5     35
marzo       33     21      1      3
abril       45     30     10     15
mayo        25     31     42      0
junio       22     11     21      0

In [108]:
#Cambiar nombres de columnas del DF
df7.columns = ['BD', 'TEBD', 'UML', 'JAVA']
df7

     BD  TEBD  UML  JAVA
ene  10     0   15    20
feb   5    15    5    35
mar  33    21    1     3
abr  45    30   10    15
may  25    31   42     0
jun  22    11   21     0

In [109]:
#Cambiar el nombre de algunas columnas
df7.rename(columns={'UML':'SI', 'JAVA':'POO'}, inplace=True)
df7

     BD  TEBD  SI  POO
ene  10     0  15   20
feb   5    15   5   35
mar  33    21   1    3
abr  45    30  10   15
may  25    31  42    0
jun  22    11  21    0

In [105]:
#Cambiar todos los indices del DF
meses2 = ['ene', 'feb', 'mar', 'abr', 'may', 'jun']
df7.index = meses2
df7

     py101  py111  py121  py301
ene     10      0     15     20
feb      5     15      5     35
mar     33     21      1      3
abr     45     30     10     15
may     25     31     42      0
jun     22     11     21      0

In [106]:
#Cambiar el nombre de algunos indices del DF
df7.rename(index={'feb':'febrero', 'may':'mayo'}, inplace=True)
df7

         py101  py111  py121  py301
ene         10      0     15     20
febrero      5     15      5     35
mar         33     21      1      3
abr         45     30     10     15
mayo        25     31     42      0
jun         22     11     21      0

In [112]:
#Cambiar el nombre de algunos indices y columnas del DF
df7.rename(index={'febrero':'feb', 'mayo':'may'}, columns={'SI':'PROG1'}, inplace=True)
df7

     BD  TEBD  PROG1  POO
ene  10     0     15   20
feb   5    15      5   35
mar  33    21      1    3
abr  45    30     10   15
may  25    31     42    0
jun  22    11     21    0

In [113]:
df7.describe()

              BD       TEBD      PROG1        POO
count   6.000000   6.000000   6.000000   6.000000
mean   23.333333  18.000000  15.666667  12.166667
std    14.706008  11.865918  14.719601  13.934370
min     5.000000   0.000000   1.000000   0.000000
25%    13.000000  12.000000   6.250000   0.750000
50%    23.500000  18.000000  12.500000   9.000000
75%    31.000000  27.750000  19.500000  18.750000
max    45.000000  31.000000  42.000000  35.000000

In [115]:
#Visualizar una columna del DF
print(type(df7["POO"]))
df7['POO']

<class 'pandas.core.series.Series'>

ene    20
feb    35
mar     3
abr    15
may     0
jun     0
Name: POO, dtype: int64

In [117]:
df7['POO'].describe()

count     6.000000
mean     12.166667
std      13.934370
min       0.000000
25%       0.750000
50%       9.000000
75%      18.750000
max      35.000000
Name: POO, dtype: float64

In [119]:
sPOO = df7["POO"]
sPOO

ene    20
feb    35
mar     3
abr    15
may     0
jun     0
Name: POO, dtype: int64

In [120]:
#UNA SOLA COLUMNA ES UN DATO DE TIPO SERIES
print(type(sPOO))

<class 'pandas.core.series.Series'>

In [124]:
#MAS DE UNA COLUMAN ES UN DATAFRAME
print(type(df7[["POO","BD"]]))
df7[["POO","BD"]]

<class 'pandas.core.frame.DataFrame'>

     POO  BD
ene   20  10
feb   35   5
mar    3  33
abr   15  45
may    0  25
jun    0  22

In [127]:
dfPOOBD = df7[["POO","BD"]]
dfPOOBD

     POO  BD
ene   20  10
feb   35   5
mar    3  33
abr   15  45
may    0  25
jun    0  22

In [132]:
#Visualizar un rango de indices (renglones)
df7['mar':'may']["POO"]

mar     3
abr    15
may     0
Name: POO, dtype: int64

In [135]:
df7['mar':'may'][["POO","BD"]]

     POO  BD
mar    3  33
abr   15  45
may    0  25

In [143]:
df7["BD"][::2]

ene    10
mar    33
may    25
Name: BD, dtype: int64

In [148]:
##
from datetime import datetime
df8 = pd.DataFrame({'nombres':('Juan Pérez',
                                 'María Sánchez'
                                 , 'Jorge Vargas',
                                 'Rodrigo Martínez'),
            'fechas':(datetime(1995,12,21), 
                      datetime(1989,1,13), 
                      datetime(1992,9,14), 
                      datetime(1993,7,8)),
            'saldo': (2500, 
                      5345, 
                      np.NaN, 
                      11323.2),
            'al_corriente':(True, 
                            True, 
                            False, 
                            True)})
df8

            nombres     fechas    saldo  al_corriente
0        Juan Pérez 1995-12-21   2500.0          True
1     María Sánchez 1989-01-13   5345.0          True
2      Jorge Vargas 1992-09-14      NaN         False
3  Rodrigo Martínez 1993-07-08  11323.2          True

In [151]:
df8.dtypes

nombres                 object
fechas          datetime64[ns]
saldo                  float64
al_corriente              bool
dtype: object

In [153]:
df8.describe()

             saldo
count      3.00000
mean    6389.40000
std     4503.36464
min     2500.00000
25%     3922.50000
50%     5345.00000
75%     8334.10000
max    11323.20000

In [157]:
df8["saldo"].describe()

count        3.00000
mean      6389.40000
std       4503.36464
min       2500.00000
25%       3922.50000
50%       5345.00000
75%       8334.10000
max      11323.20000
Name: saldo, dtype: float64

In [167]:
df8["saldo"].astype(str)

0     2500.0
1     5345.0
2        nan
3    11323.2
Name: saldo, dtype: object

In [170]:
df8["fechas"].astype(int)

0    819504000000000000
1    600652800000000000
2    716428800000000000
3    742089600000000000
Name: fechas, dtype: int64

In [172]:
df8["saldo"]*1.16

0     2900.000
1     6200.200
2          NaN
3    13134.912
Name: saldo, dtype: float64

In [174]:
df8["saldo"]

0     2500.0
1     5345.0
2        NaN
3    11323.2
Name: saldo, dtype: float64

In [178]:
#AGREGAR COLUMNAS O DATOS A MI DATAFRAME
df8["saldo_iva"]=df8["saldo"]*1.16
df8

            nombres     fechas    saldo  al_corriente  saldo_iva
0        Juan Pérez 1995-12-21   2500.0          True   2900.000
1     María Sánchez 1989-01-13   5345.0          True   6200.200
2      Jorge Vargas 1992-09-14      NaN         False        NaN
3  Rodrigo Martínez 1993-07-08  11323.2          True  13134.912

In [179]:
df8.dtypes

nombres                 object
fechas          datetime64[ns]
saldo                  float64
al_corriente              bool
saldo_iva              float64
dtype: object

In [182]:
#CONVERTIMOS EL TIPO DE DATO DE LA COLUMNA saldo_iva A STRING

df8["saldo_iva"]=df8["saldo_iva"].astype(str)
df8.dtypes

nombres                 object
fechas          datetime64[ns]
saldo                  float64
al_corriente              bool
saldo_iva               object
dtype: object

In [186]:
#COMPROBAMOS QUE AL MULTIPLICAR YA TOMA VALORES COMO STRING 
#Y NO COMO NUMERO

df8["saldo_iva"]*2

0          2900.02900.0
1          6200.26200.2
2                nannan
3    13134.91213134.912
Name: saldo_iva, dtype: object